#!/bin/bash

########################################################################################################################
# 目录变量
########################################################################################################################
SCT_DIR=$(cd $(dirname $0) && pwd) # scripts
RES_DIR=$(dirname ${SCT_DIR})      # reources
PJT_DIR=$(dirname ${RES_DIR})      # repo
BLT_DIR=${PJT_DIR}/build_unittest  # build

########################################################################################################################
# 依赖库编译环境变量
########################################################################################################################
ENVS_ROOT=${HOME}/.envs
LIBS_PATH=x86_64-linux-gnu-v9.4.0
LIBS_ROOT=${ENVS_ROOT}/libs/${LIBS_PATH}

########################################################################################################################
# 编译
########################################################################################################################
rm -rf "${BLT_DIR}"
mkdir -p "${BLT_DIR}" && cd "${BLT_DIR}"
cmake .. -G"Unix Makefiles"
make -j16 test_module_add
make -j16 test_module_sub
make -j16 test_module_all
########################################################################################################################
# 运行测试程序并生成XML报告
########################################################################################################################
${BLT_DIR}/tests/test_module_add/test_module_add --gtest_output="xml:test_module_add.xml" 2>&1 >/dev/null
${BLT_DIR}/tests/test_module_sub/test_module_sub --gtest_output="xml:test_module_sub.xml" 2>&1 >/dev/null
${BLT_DIR}/tests/test_module_all/test_module_all --gtest_output="xml:test_module_all.xml" 2>&1 >/dev/null

########################################################################################################################
# 转换单元测试报告到HTML形式
########################################################################################################################
xsltproc ${RES_DIR}/tools/gtest2html.xslt "test_module_add.xml" >test_module_add.html
xsltproc ${RES_DIR}/tools/gtest2html.xslt "test_module_sub.xml" >test_module_sub.html
xsltproc ${RES_DIR}/tools/gtest2html.xslt "test_module_all.xml" >test_module_all.html

########################################################################################################################
# 拷贝报告到输出目录
########################################################################################################################
# cp ${BLT_DIR}/unittest.html ${PJT_DIR}/doc/IP42_RPM_单元测试报告.html

########################################################################################################################
# 显示报告
########################################################################################################################
if [[ $1 == "show" ]]; then
  firefox --new-tab ${BLT_DIR}/test_module_add.html
  firefox --new-tab ${BLT_DIR}/test_module_sub.html
  firefox --new-tab ${BLT_DIR}/test_module_all.html
fi
